# ProgressDlgEnd

## Description
End a progress context started with ProgressDlgStart. This will make the progress jump to the percentage declared when started.

```pascal
PROCEDURE ProgressDlgEnd;
```

```python
def vs.ProgressDlgEnd():
    return None
```

## Examples
les can be found at [[VS:Progress Dialog]].

## See Also
ProgressDlgOpen | ProgressDlgClose | ProgressDlgSetTopMsg | ProgressDlgSetBotMsg | ProgressDlgSetMeter | ProgressDlgStart | ProgressDlgEnd | ProgressDlgHasCancel | ProgressDlgYeld

## Version
Availability: from Vectorworks 2015

## Category
* Utility